//
//  File.swift
//  othelloSwift
//
//  Created by Kazuki on 2020/08/10.
//  Copyright © 2020 susu. All rights reserved.
//

import Foundation

struct OthelloInital {
    /// オセロ配置
    /// 00 01 02 03 04 05 06 07
    /// 08 09 10 11 12 13 14 15
    /// 16 17 18 19 20 21 22 23
    /// 24 25 26 27 28 29 30 31
    /// 32 33 34 35 36 37 38 39
    /// 40 41 42 43 44 45 46 47
    /// 48 49 50 51 52 53 54 55
    /// 56 57 58 59 60 61 62 63
    /// 上下左右左上右上左下右下の処理(allocable)
    /// 北西:-7
    /// 北:-8
    /// 北東:-9
    /// 南西:+7
    /// 南:+8
    /// 南東:+9
    /// 西:+1
    /// 東:-1
    let blackArrangement = [27, 36]
    let whiteArrangement = [28, 35]
    /// 全方位検索用
    let northwestWallEdge = [40, 32, 24, 16, 8, 0, 1, 2, 3 ,4 ,5]
    let northWallEdge = [0, 1, 2, 3 ,4 ,5, 6, 7]
    let northeastWallEdge = [2, 3 ,4 ,5, 6, 7, 15, 23, 31, 39, 47]
    let westWallEdge = [0, 8, 16, 24, 32, 40, 48, 56]
    let eastWallEdge = [7, 15, 23, 31, 39, 47, 55, 63]
    let wallEdge = [0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,15 ,16 ,23 ,24 ,31 ,32 ,39 ,40 ,47 ,48 ,55 ,56, 63]

    /// オセロ配列(2次元配列)
    /// 00 01 02 03 04 05 06 07
    /// 10 11 12 13 14 15 16 17
    /// 20 21 22 23 24 25 26 27
    /// 30 31 32 33 34 35 36 37
    /// 40 41 42 43 44 45 46 47
    /// 50 51 52 53 54 55 56 57
    /// 60 61 62 63 64 65 66 67
    /// 70 71 72 73 74 75 76 77
    /// 上下左右左上右上左下右下の処理(allocable)
    /// 北西:[Y-1][X+1]
    /// 北:[Y-1][X]
    /// 北東:[Y-1][X-1]
    /// 南西:[Y+1][X-1]
    /// 南:[Y+1][X]
    /// 南東:[Y+1][X+1]
    /// 西:[Y][X+1]
    /// 東:[Y][X-1]

}
